
#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПрефиксацияОбъектовДокумент(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Префикс = ПланыОбмена.Полный.ЭтотУзел().Преффикс + ОбщегоНазначения.РеквизитОбъекта(Источник.Клиент, "Преффикс");	
КонецПроцедуры





Процедура ПрефиксацияОбъектовСправочники(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
		СтандартнаяОбработка = Ложь;
	Префикс = ПланыОбмена.Полный.ЭтотУзел().Преффикс;
КонецПроцедуры
#КонецОбласти

